[
  {
    "id": "1",
    "title": "HTML & CSS: Design and Build Websites",
    "author": "J Duckett",
    "description": "HTML or Hypertext Markup Language, HTML is the standard language used worldwide for creating and writing web pages. Meaning that is the standard for web browsers to show and display all the information on your screen. How is the language built? HTML uses tags to define and structure the content on the webpage, and the recognizable angel brackets (<>), the angle brackets and the tags are used for defining headings, lists, and links.HTML is using small notes and elements for the computer to manipulate into the structure created by the developer. HTML by nature is not only readable for the computer using these small notes it’s also very readable for humans. HTML have many features that comes with the language by default, listed below is some of them. HTML works on every web browser, as mentioned before, therefor HTML reaches out to almost every people in the world, if you can write and understand HTML you are very employable. With its easy syntax and highly customizable for creating web pages it’s a good language to start with when you are an beginner, it has a very large sample size on the web. HTML can interact with other languages such as JavaScript to create and maintain very creative web pages and highly functional pages. HTML also acts like a bridge between backend and frontend connecting databases and adding scripts when you press a certain button, maybe fetching a function written in JavaScript that gets information from a database, all within HTML.  ",
    "category": "HTML",
    "price": 1300,
    "img": "/img/html.jpg"
  },
  {
    "id": "2",
    "title": "Bootstrap 4 Responsive Web Design",
    "author": "Silvio Moreto",
    "description": "Responsive web design with Bootstrap- Responsive web design is a technique that refers to the ability and utility for a website and application to adjust and dynamically change its layout based on the device that is used. Bootstrap is a very popular framework used in web development, the bootstrap framework has pre-designed code and code bits that includes CSS and JavaScript that helps the developer to create that responsive web design quickly and easily.Bootstrap and the responsive features are based on a flexbox or a grid system, this grid system is made up from rows and columns, the developer can specify the size and on that note with the help of bootstrap and the grid system have the size fit different devices. As mentioned in the beginning the ability and utility including in bootstrap are such that it includes classes that is used to hide and show content based on the screen size, adjust the images included in the webpage and also adjust the text in the same way. It can also include responsive navigation, meaning that it automatically adjusts to different screen sizes. There are many more features that comes with responsive web design and with bootstrap, and the benefits of using it is far more, examples of some benefits can be:free and open-source – and with that its constant in development, developer can further enhance the responsiveness and development of bootstrap using its community. It’s easy to customize, its easy to meet the requirements from the customer, all that is included in bootstrap does it easy to make the customers wishes come true, such as color scheme, border padding etc. Widely used, bootstrap is used everywhere, meaning if you master the bootstrap and the responsive web design with comparable frameworks you are highly requested on the job market, and makes you as developer more employable.  ",
    "category": "bootstrap",
    "price": 1450,
    "img": "/img/bootstrap1.jpg"
  },
  {
    "id": "3",
    "title": "CSS the definitive guide",
    "author": "A Meyer",
    "description": "CSS or cascading style sheets is a language developers use for styling a web page, CSS is a description of a document written in HTML or XML for presenting the style on the web page. CSS allows developers to change the styling and layout aspect of a web page without changing the content from the page. CSS provides many different styles to explore, and variety to them, you as developer can write CSS and apply it to the HTML, change the appearance as hole, such as font size, color and so on.CSS provides many different features, such feature can be that the styles created can be inherited and overridden based on the developers needs and thoughts, making it very flexible and easy to create consistent styles across a website, CSS brings color to your web page in other words, it’s the tool to be creative with. CSS is a tool for web developers to make their web sites look good, CSS is a language that is well updated and keeps on getting updates, with better features and more handy stuffs that make the language so coveted, in the latest updates the CSS grid and CSS flexbox was introduced as example. Which helps the developer make more advanced and creative layouts. Not only are the CSS language styling web pages, but it also helps with the responsiveness of the webpage and their layout, to different screen sizes and devices. Developers can also add animations and interactive elements to their page on different devices that all scale to just that device.",
    "category": "CSS",
    "price": 1550,
    "img": "/img/CSS.jpg"
  },
  {
    "id": "4",
    "title": "Programming JavaScript",
    "author": "Pontus Walck",
    "description": "JavaScript is a programming language used to add interactivity and functionality to web pages. It has a wide range of applications, from creating basic animations to building complex web applications, when JavaScript for example is executed it can change the context on a web page without needing the user to reload it. JavaScript is a versatile programming language that provides web developers with a wide range of functionalities. For instance, it can be used to perform form validation, which involves checking whether user input meets specified criteria. JavaScript can create responsive menus that adapt to different screen sizes, and interactive maps that enable users to click on different locations to access information. By retrieving data from servers, JavaScript allows for real-time updates, enhancing the user experience. The flexibility of JavaScript enables developers to create complex and dynamic web applications that can perform various tasks. JavaScript is constantly evolving, new frameworks and libraries are frequently introduced, making it a perfect tool for web developers to use and to maintain cutting edge functionality. ensuring that it remains a popular and relevant programming language for the future. By keeping up to date with the latest developments in JavaScript, developers can take advantage of new features and functions to create innovative applications that meet the changing needs of users.",
    "category": "JavaScript",
    "price": 1450,
    "img": "/img/javascript.jpg"
  },
  {
    "id": "5",
    "title": "Head First HTML and CSS: A Learners Guide",
    "author": "Elisabeth Robson",
    "description": "If youre tired of all the technical jargon in HTML/CSS forums and tutorials, this is the book for you.",
    "category": "HTML",
    "price": 250,
    "img": "/img/html2.jpg"
  },
  {
    "id": "6",
    "title": "A Smarter Way to Learn HTML & CSS: Learn it faster",
    "author": "Mark Myers",
    "description": "In “A Smarter Way to Learn HTML & CSS: Learn it faster. Remember it longer”, ",
    "category": "HTML",
    "price": 350,
    "img": "/img/html3.jpg"
  },
  {
    "id": "7",
    "title": "Learning Web Design: A Beginners Guide to HTML, CSS, JavaScript, and Web Graphics",
    "author": "Jennifer Robins",
    "description": "Imagine learning HTML/CSS from the most experienced web designers in the world. Well, thats precisely what you get from this book.",
    "category": "HTML",
    "price": 200,
    "img": "/img/html4.jpg"
  },
  {
    "id": "8",
    "title": "Bootstrap in 24 Hours",
    "author": "Jennifer Kyrnin",
    "description": "In just 24 lessons of one hour or less, Sams Teach Yourself Bootstrap in 24 Hours helps you use the free and open source Bootstrap framework",
    "category": "bootstrap",
    "price": 300,
    "img": "/img/bootstrap2.jpg"
  },
  {
    "id": "9",
    "title": "Unraveling Bootstrap 3.3",
    "author": "István Novák",
    "description": "With the newest version of Bootstrap(before v4) theres a lot to learn and a lot to practice. Thankfully this book is super affordable and covers over 300 pages of Bootstrap 3 info.",
    "category": "bootstrap",
    "price": 500,
    "img": "/img/bootstrap33.jpg"
  },
  {
    "id": "10",
    "title": "Jump Start Bootstrap",
    "author": "Syed Fazle Rahman",
    "description": "Get a Jump Start on building applications with Bootstrap today",
    "category": "bootstrap",
    "price": 350,
    "img": "/img/bootstrap3.jpg"
  },
  {
    "id": "11",
    "title": "Bootstrap by Example",
    "author": "Silvio Moreto",
    "description": "Become an expert in Bootstrap framework, and speed up front-end development and prototyping through real-life examples",
    "category": "bootstrap",
    "price": 400,
    "img": "/img/bootstrap4.jpg"
  },
  {
    "id": "12",
    "title": "CSS Mastery 3rd Edition",
    "author": "Andy Budd",
    "description": "CSS Mastery is your indispensable guide to cutting-edge CSS development",
    "category": "CSS",
    "price": 300,
    "img": "/img/css2.jpg"
  },
  {
    "id": "13",
    "title": "CSS Pocket Reference: Visual Presentation for the Web",
    "author": "A. Meyer",
    "description": "When youre working with CSS and need an answer now, this concise yet comprehensive quick reference provides the essential information you need",
    "category": "CSS",
    "price": 200,
    "img": "/img/css3.jpg"
  },
  {
    "id": "14",
    "title": "HTML, CSS, and JavaScript All in One",
    "author": "Jennifer Kyrnin",
    "description": "Teach Yourself HTML, CSS, and JavaScript All in One combines these three fundamental web development technologies",
    "category": "CSS",
    "price": 350,
    "img": "/img/css4.jpg"
  },
  {
    "id": "15",
    "title": "CSS: The Missing Manual",
    "author": "David McFarland",
    "description": "This fully updated edition provides the most modern and effective tips",
    "category": "CSS",
    "price": 300,
    "img": "/img/css1.jpg"
  },
  {
    "id": "16",
    "title": "A Smarter Way to Learn JavaScript",
    "author": "A Myers",
    "description": "This book is written for beginners to JavaScript, but also very useful for experienced developers who want to sharpen their skills",
    "category": "JavaScript",
    "price": 400,
    "img": "/img/js5.jpg"
  },
  {
    "id": "17",
    "title": "Head First JavaScript Programming: A Brain-Friendly Guide",
    "author": "Elisabeth Robson",
    "description": "Head First JavaScript Programming is designed with the latest research in cognitive science",
    "category": "JavaScript",
    "price": 250,
    "img": "/img/js6.jpg"
  },
  {
    "id": "18",
    "title": "Eloquent JavaScript",
    "author": "Marijn Haverbeke",
    "description": "This latest edition of Eloquent JavaScript dives deep into the JavaScript language to help you write clean and beautiful code",
    "category": "JavaScript",
    "price": 200,
    "img": "/img/js3.jpg"
  },
  {
    "id": "19",
    "title": "JavaScript: The Definitive Guide",
    "author": "David Flanagan",
    "description": "his classic has been the go-to JavaScript book for programmers for nearly 25 years.",
    "category": "JavaScript",
    "price": 500,
    "img": "/img/js4.jpg"
  },
  {
    "id": "20",
    "title": "HTML5 and CSS3 All-in-One For Dummies",
    "author": "A Meyer",
    "description": "Last on our list of the best books to learn HTML and CSS is this all-in-one guide “for dummies,”",
    "category": "HTML",
    "price": 300,
    "img": "/img/html5.jpg"
  }


]